; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_3 type_1)
 (:predicates (pred_1 ?v6 - type_3 ?v2 - type_2)
 	      (pred_4 ?v4 - object ?v2 - type_2)
	      (pred_3 ?v6 - type_3 ?v8 - type_1)
	      (pred_2 ?v6 - type_3 ?v4 - object ?v8 - type_1))

   (:action op_3
       :parameters  (?v6 - type_3 ?v7 ?v5 - type_2)
       :precondition (and  (pred_1 ?v6 ?v7))
       :effect (and  (pred_1 ?v6 ?v5)
		     (not (pred_1 ?v6 ?v7))))

   (:action op_1
       :parameters (?v6 - type_3 ?v3 - object ?v1 - type_2 ?v8 - type_1)
       :precondition  (and  (pred_4 ?v3 ?v1) (pred_1 ?v6 ?v1) (pred_3 ?v6 ?v8))
       :effect (and (pred_2 ?v6 ?v3 ?v8)
		    (not (pred_4 ?v3 ?v1)) 
		    (not (pred_3 ?v6 ?v8))))

   (:action op_2
       :parameters (?v6 - type_3 ?v3 - object ?v1 - type_2 ?v8 - type_1)
       :precondition  (and  (pred_2 ?v6 ?v3 ?v8) (pred_1 ?v6 ?v1))
       :effect (and (pred_4 ?v3 ?v1)
		    (pred_3 ?v6 ?v8)
		    (not (pred_2 ?v6 ?v3 ?v8)))))

; problem
(define (problem gripper-1-4-3)
(:domain gripper-strips)
(:objects obj_05 - type_3
obj_02 obj_03 - type_1
obj_01 obj_09 obj_07 obj_04 - type_2
obj_08 obj_10 obj_06 - object)
(:init
(pred_1 obj_05 obj_09)
(pred_3 obj_05 obj_02)
(pred_3 obj_05 obj_03)
(pred_4 obj_08 obj_09)
(pred_4 obj_10 obj_01)
(pred_4 obj_06 obj_07)
)
(:goal
(and
(pred_4 obj_08 obj_07)
(pred_4 obj_10 obj_01)
(pred_4 obj_06 obj_09)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_2 obj_05 ?b obj_02))))
)
)

; plan
1. (op_1 obj_05 obj_08 obj_09 obj_03)
   deleted: (pred_4 obj_08 obj_09) (pred_3 obj_05 obj_03)
   added: (pred_2 obj_05 obj_08 obj_03)
   goals met: 1 of 3
2. (op_3 obj_05 obj_09 obj_07)
   deleted: (pred_1 obj_05 obj_09)
   added: (pred_1 obj_05 obj_07)
   goals met: 1 of 3
3. (op_2 obj_05 obj_08 obj_07 obj_03)
   deleted: (pred_2 obj_05 obj_08 obj_03)
   added: (pred_4 obj_08 obj_07) (pred_3 obj_05 obj_03)
   goals met: 2 of 3
4. (op_1 obj_05 obj_06 obj_07 obj_03)
   deleted: (pred_4 obj_06 obj_07) (pred_3 obj_05 obj_03)
   added: (pred_2 obj_05 obj_06 obj_03)
   goals met: 2 of 3
5. (op_3 obj_05 obj_07 obj_09)
   deleted: (pred_1 obj_05 obj_07)
   added: (pred_1 obj_05 obj_09)
   goals met: 2 of 3
6. (op_2 obj_05 obj_06 obj_09 obj_03)
   deleted: (pred_2 obj_05 obj_06 obj_03)
   added: (pred_4 obj_06 obj_09) (pred_3 obj_05 obj_03)
   goals met: 3 of 3
